benchmark/ab/test3000-100
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/2.2.2
Server Hostname:        localhost
Server Port:            5001

Document Path:          /
Document Length:        20 bytes

Concurrency Level:      100
Time taken for tests:   2.517 seconds
Complete requests:      3000
Failed requests:        0
Total transferred:      579000 bytes
HTML transferred:       60000 bytes
Requests per second:    1192.10 [#/sec] (mean)
Time per request:       83.886 [ms] (mean)
Time per request:       0.839 [ms] (mean, across all concurrent requests)
Transfer rate:          224.68 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       3
Processing:     8   82   6.9     83     105
Waiting:        6   81   6.9     82     103
Total:          8   82   6.7     83     108

Percentage of the requests served within a certain time (ms)
  50%     83
  66%     84
  75%     84
  80%     85
  90%     86
  95%     88
  98%     91
  99%     97
 100%    108 (longest request)