benchmark/ab/test3000-100-swarm
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/2.2.2
Server Hostname:        localhost
Server Port:            5001

Document Path:          /
Document Length:        20 bytes

Concurrency Level:      100
Time taken for tests:   4.630 seconds
Complete requests:      3000
Failed requests:        0
Total transferred:      579000 bytes
HTML transferred:       60000 bytes
Requests per second:    647.89 [#/sec] (mean)
Time per request:       154.348 [ms] (mean)
Time per request:       1.543 [ms] (mean, across all concurrent requests)
Transfer rate:          122.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.7      0      20
Processing:     1  152 166.0    107    1135
Waiting:        1  149 164.5    106    1121
Total:          1  152 165.9    107    1135

Percentage of the requests served within a certain time (ms)
  50%    107
  66%    154
  75%    186
  80%    217
  90%    344
  95%    438
  98%    738
  99%    935
 100%   1135 (longest request)