benchmark/ab/test30000-10
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/2.2.2
Server Hostname:        localhost
Server Port:            5001

Document Path:          /
Document Length:        20 bytes

Concurrency Level:      10
Time taken for tests:   46.073 seconds
Complete requests:      30000
Failed requests:        0
Total transferred:      5790000 bytes
HTML transferred:       600000 bytes
Requests per second:    651.14 [#/sec] (mean)
Time per request:       15.358 [ms] (mean)
Time per request:       1.536 [ms] (mean, across all concurrent requests)
Transfer rate:          122.73 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    7 327.2      0   19510
Processing:     1    9  15.7      8     540
Waiting:        1    8  14.1      7     538
Total:          1   15 327.5      8   19519

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%      9
  80%     10
  90%     10
  95%     11
  98%     13
  99%     19
 100%  19519 (longest request)