benchmark/ab/test30000-10-swarm
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/2.2.2
Server Hostname:        localhost
Server Port:            5001

Document Path:          /
Document Length:        20 bytes

Concurrency Level:      10
Time taken for tests:   38.466 seconds
Complete requests:      30000
Failed requests:        0
Total transferred:      5790000 bytes
HTML transferred:       600000 bytes
Requests per second:    779.91 [#/sec] (mean)
Time per request:       12.822 [ms] (mean)
Time per request:       1.282 [ms] (mean, across all concurrent requests)
Transfer rate:          147.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0      63
Processing:     1   13  15.8      6     218
Waiting:        0   12  15.0      5     196
Total:          1   13  15.9      6     219

Percentage of the requests served within a certain time (ms)
  50%      6
  66%     11
  75%     16
  80%     20
  90%     33
  95%     45
  98%     61
  99%     73
 100%    219 (longest request)